RT-Thread/rt-thread/bsp/hc32/libraries/hc32f472_ddl/cmsis/Device/HDSC/hc32f4xx/Source/ARM/startup_hc32f472.s
;/**
; ******************************************************************************
;  @file  startup_hc32f472.s
;  @brief Startup for MDK.
; verbatim
;  Change Logs:
;  Date             Author          Notes
;  2022-06-30       CDT             First version
;  2023-12-15       CDT             TMR6_x_GDet_Handler -> TMR6_x_Dte_Handler
; endverbatim
; *****************************************************************************
; * Copyright (C) 2022-2023, Xiaohua Semiconductor Co., Ltd. All rights reserved.
; *
; * This software component is licensed by XHSC under BSD 3-Clause license
; * (the "License"); You may not use this file except in compliance with the
; * License. You may obtain a copy of the License at:
; *                    opensource.org/licenses/BSD-3-Clause
; *
; ******************************************************************************
; */

; Stack Configuration
; Stack Size (in Bytes) <0x0-0xFFFFFFFF:8>

Stack_Size      EQU     0x00000C00

                AREA    STACK, NOINIT, READWRITE, ALIGN=3
Stack_Mem       SPACE   Stack_Size
__initial_sp


; Heap Configuration
;  Heap Size (in Bytes) <0x0-0xFFFFFFFF:8>

Heap_Size       EQU     0x00000400

                AREA    HEAP, NOINIT, READWRITE, ALIGN=3
__heap_base
Heap_Mem        SPACE   Heap_Size
__heap_limit

                PRESERVE8
                THUMB

; Vector Table Mapped to Address 0 at Reset

                AREA    RESET, DATA, READONLY
                EXPORT  __Vectors
                EXPORT  __Vectors_End
                EXPORT  __Vectors_Size

__Vectors       DCD     __initial_sp              ; Top of Stack
                DCD     Reset_Handler             ; Reset Handler
                DCD     NMI_Handler               ; NMI Handler
                DCD     HardFault_Handler         ; Hard Fault Handler
                DCD     MemManage_Handler         ; MPU Fault Handler
                DCD     BusFault_Handler          ; Bus Fault Handler
                DCD     UsageFault_Handler        ; Usage Fault Handler
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     SVC_Handler               ; SVCall Handler
                DCD     DebugMon_Handler          ; Debug Monitor Handler
                DCD     0                         ; Reserved
                DCD     PendSV_Handler            ; PendSV Handler
                DCD     SysTick_Handler           ; SysTick Handler

                ; Peripheral Interrupts
                DCD     IRQ000_Handler
                DCD     IRQ001_Handler
                DCD     IRQ002_Handler
                DCD     IRQ003_Handler
                DCD     IRQ004_Handler
                DCD     IRQ005_Handler
                DCD     IRQ006_Handler
                DCD     IRQ007_Handler
                DCD     IRQ008_Handler
                DCD     IRQ009_Handler
                DCD     IRQ010_Handler
                DCD     IRQ011_Handler
                DCD     IRQ012_Handler
                DCD     IRQ013_Handler
                DCD     IRQ014_Handler
                DCD     IRQ015_Handler
                DCD     EXTINT00_SWINT16_Handler
                DCD     EXTINT01_SWINT17_Handler
                DCD     EXTINT02_SWINT18_Handler
                DCD     EXTINT03_SWINT19_Handler
                DCD     EXTINT04_SWINT20_Handler
                DCD     EXTINT05_SWINT21_Handler
                DCD     EXTINT06_SWINT22_Handler
                DCD     EXTINT07_SWINT23_Handler
                DCD     EXTINT08_SWINT24_Handler
                DCD     EXTINT09_SWINT25_Handler
                DCD     EXTINT10_SWINT26_Handler
                DCD     EXTINT11_SWINT27_Handler
                DCD     EXTINT12_SWINT28_Handler
                DCD     EXTINT13_SWINT29_Handler
                DCD     EXTINT14_SWINT30_Handler
                DCD     EXTINT15_SWINT31_Handler
                DCD     DMA1_Error_Handler
                DCD     DMA1_TC0_BTC0_Handler
                DCD     DMA1_TC1_BTC1_Handler
                DCD     DMA1_TC2_BTC2_Handler
                DCD     DMA1_TC3_BTC3_Handler
                DCD     DMA1_TC4_BTC4_Handler
                DCD     DMA1_TC5_BTC5_Handler
                DCD     DMA1_TC6_BTC6_Handler
                DCD     DMA1_TC7_BTC7_Handler
                DCD     EFM_PEError_ReadCol_Handler
                DCD     EFM_OpEnd_Handler
                DCD     QSPI_Handler
                DCD     DCU1_Handler
                DCD     DCU2_Handler
                DCD     DCU3_Handler
                DCD     DMA2_Error_Handler
                DCD     DMA2_TC0_BTC0_Handler
                DCD     DMA2_TC1_BTC1_Handler
                DCD     DMA2_TC2_BTC2_Handler
                DCD     DMA2_TC3_BTC3_Handler
                DCD     DMA2_TC4_BTC4_Handler
                DCD     DMA2_TC5_BTC5_Handler
                DCD     DMA2_TC6_BTC6_Handler
                DCD     DMA2_TC7_BTC7_Handler
                DCD     MAU_Handler
                DCD     FMAC1_Handler
                DCD     FMAC2_Handler
                DCD     FMAC3_Handler
                DCD     FMAC4_Handler
                DCD     TMR0_1_Cmp_Handler
                DCD     TMR0_2_Cmp_Handler
                DCD     TMR2_1_Cmp_Handler
                DCD     TMR2_1_Ovf_Handler
                DCD     TMR2_2_Cmp_Handler
                DCD     TMR2_2_Ovf_Handler
                DCD     TMR2_3_Cmp_Handler
                DCD     TMR2_3_Ovf_Handler
                DCD     TMR2_4_Cmp_Handler
                DCD     TMR2_4_Ovf_Handler
                DCD     RTC_Handler
                DCD     CLK_XtalStop_Handler
                DCD     PWC_WKTM_Handler
                DCD     SWDT_Handler
                DCD     TMR6_1_GCmp_Handler
                DCD     TMR6_1_Ovf_Udf_Handler
                DCD     TMR6_1_Dte_Handler
                DCD     TMR6_1_SCmp_Handler
                DCD     TMRA_1_Ovf_Udf_Handler
                DCD     TMRA_1_Cmp_Handler
                DCD     TMR6_2_GCmp_Handler
                DCD     TMR6_2_Ovf_Udf_Handler
                DCD     TMR6_2_Dte_Handler
                DCD     TMR6_2_SCmp_Handler
                DCD     TMRA_2_Ovf_Udf_Handler
                DCD     TMRA_2_Cmp_Handler
                DCD     TMR6_3_GCmp_Handler
                DCD     TMR6_3_Ovf_Udf_Handler
                DCD     TMR6_3_Dte_Handler
                DCD     TMR6_3_SCmp_Handler
                DCD     TMRA_3_Ovf_Udf_Handler
                DCD     TMRA_3_Cmp_Handler
                DCD     TMR6_4_GCmp_Handler
                DCD     TMR6_4_Ovf_Udf_Handler
                DCD     TMR6_4_Dte_Handler
                DCD     TMR6_4_SCmp_Handler
                DCD     TMRA_4_Ovf_Udf_Handler
                DCD     TMRA_4_Cmp_Handler
                DCD     TMR6_5_GCmp_Handler
                DCD     TMR6_5_Ovf_Udf_Handler
                DCD     TMR6_5_Dte_Handler
                DCD     TMR6_5_SCmp_Handler
                DCD     0
                DCD     TMR6_6_GCmp_Handler
                DCD     TMR6_6_Ovf_Udf_Handler
                DCD     TMR6_6_Dte_Handler
                DCD     TMR6_6_SCmp_Handler
                DCD     TMR6_7_GCmp_Handler
                DCD     TMR6_7_Ovf_Udf_Handler
                DCD     TMR6_7_Dte_Handler
                DCD     TMR6_7_SCmp_Handler
                DCD     TMR6_8_GCmp_Handler
                DCD     TMR6_8_Ovf_Udf_Handler
                DCD     TMR6_8_Dte_Handler
                DCD     TMR6_8_SCmp_Handler
                DCD     TMR6_9_GCmp_Handler
                DCD     TMR6_9_Ovf_Udf_Handler
                DCD     TMR6_9_Dte_Handler
                DCD     TMR6_9_SCmp_Handler
                DCD     TMR6_10_GCmp_Handler
                DCD     TMR6_10_Ovf_Udf_Handler
                DCD     TMR6_10_Dte_Handler
                DCD     TMR6_10_SCmp_Handler
                DCD     TMR4_1_GCmp_Handler
                DCD     TMR4_1_Ovf_Udf_Handler
                DCD     TMR4_1_Reload_Handler
                DCD     TMR4_1_SCmp_Handler
                DCD     CMP1_Handler
                DCD     CMP2_Handler
                DCD     CMP3_Handler
                DCD     CMP4_Handler
                DCD     CAN1_Handler
                DCD     CAN2_Handler
                DCD     CAN3_Handler
                DCD     USART1_Handler
                DCD     USART2_Handler
                DCD     SPI1_Handler
                DCD     SPI2_Handler
                DCD     TMRA_5_Ovf_Udf_Handler
                DCD     TMRA_5_Cmp_Handler
                DCD     TMRA_6_Ovf_Udf_Handler
                DCD     TMRA_6_Cmp_Handler
                DCD     USBFS_Handler
                DCD     EVENT_PORT1_Handler
                DCD     EVENT_PORT2_Handler
                DCD     EVENT_PORT3_Handler
                DCD     EVENT_PORT4_Handler
                DCD     USART3_Handler
                DCD     USART4_Handler
                DCD     SPI3_Handler
                DCD     SPI4_Handler
                DCD     EMB_GR0_Handler
                DCD     EMB_GR1_Handler
                DCD     EMB_GR2_Handler
                DCD     EMB_GR3_Handler
                DCD     EMB_GR4_Handler
                DCD     EMB_GR5_Handler
                DCD     EMB_GR6_Handler
                DCD     HASH_Handler
                DCD     USART5_Handler
                DCD     USART6_Handler
                DCD     MDIO_Handler
                DCD     PLA_Handler
                DCD     I2C1_Handler
                DCD     I2C2_Handler
                DCD     I2C3_Handler
                DCD     USART1_WKUP_Handler
                DCD     PWC_LVD1_Handler
                DCD     PWC_LVD2_Handler
                DCD     OTS_Handler
                DCD     FCM_Handler
                DCD     WDT_Handler
                DCD     CTC_Handler
                DCD     ADC1_Handler
                DCD     ADC2_Handler
                DCD     ADC3_Handler
                DCD     TRNG_Handler
                DCD     USART1_TxComplete_Handler
                DCD     USART2_TxComplete_Handler
                DCD     USART3_TxComplete_Handler
                DCD     USART4_TxComplete_Handler
                DCD     USART5_TxComplete_Handler
                DCD     USART6_TxComplete_Handler

__Vectors_End

__Vectors_Size  EQU     __Vectors_End - __Vectors

                AREA    |.text|, CODE, READONLY

