RT-Thread/rt-thread/bsp/hc32/libraries/hc32f472_ddl/cmsis/Device/HDSC/hc32f4xx/Source/ARM/startup_hc32f472.s
; Reset Handler

Reset_Handler   PROC
                EXPORT  Reset_Handler             [WEAK]
                IMPORT  SystemInit
                IMPORT  __main

                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =__main
                BX      R0
                ENDP

; Dummy Exception Handlers (infinite loops which can be modified)

NMI_Handler     PROC
                EXPORT  NMI_Handler               [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler         [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler         [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler          [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler        [WEAK]
                B       .
                ENDP
SVC_Handler     PROC
                EXPORT  SVC_Handler               [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler          [WEAK]
                B       .
                ENDP
PendSV_Handler  PROC
                EXPORT  PendSV_Handler            [WEAK]
                B       .
                ENDP
SysTick_Handler PROC
                EXPORT  SysTick_Handler           [WEAK]
                B       .
                ENDP

Default_Handler PROC
                EXPORT  IRQ000_Handler                  [WEAK]
                EXPORT  IRQ001_Handler                  [WEAK]
                EXPORT  IRQ002_Handler                  [WEAK]
                EXPORT  IRQ003_Handler                  [WEAK]
                EXPORT  IRQ004_Handler                  [WEAK]
                EXPORT  IRQ005_Handler                  [WEAK]
                EXPORT  IRQ006_Handler                  [WEAK]
                EXPORT  IRQ007_Handler                  [WEAK]
                EXPORT  IRQ008_Handler                  [WEAK]
                EXPORT  IRQ009_Handler                  [WEAK]
                EXPORT  IRQ010_Handler                  [WEAK]
                EXPORT  IRQ011_Handler                  [WEAK]
                EXPORT  IRQ012_Handler                  [WEAK]
                EXPORT  IRQ013_Handler                  [WEAK]
                EXPORT  IRQ014_Handler                  [WEAK]
                EXPORT  IRQ015_Handler                  [WEAK]
                EXPORT  EXTINT00_SWINT16_Handler        [WEAK]
                EXPORT  EXTINT01_SWINT17_Handler        [WEAK]
                EXPORT  EXTINT02_SWINT18_Handler        [WEAK]
                EXPORT  EXTINT03_SWINT19_Handler        [WEAK]
                EXPORT  EXTINT04_SWINT20_Handler        [WEAK]
                EXPORT  EXTINT05_SWINT21_Handler        [WEAK]
                EXPORT  EXTINT06_SWINT22_Handler        [WEAK]
                EXPORT  EXTINT07_SWINT23_Handler        [WEAK]
                EXPORT  EXTINT08_SWINT24_Handler        [WEAK]
                EXPORT  EXTINT09_SWINT25_Handler        [WEAK]
                EXPORT  EXTINT10_SWINT26_Handler        [WEAK]
                EXPORT  EXTINT11_SWINT27_Handler        [WEAK]
                EXPORT  EXTINT12_SWINT28_Handler        [WEAK]
                EXPORT  EXTINT13_SWINT29_Handler        [WEAK]
                EXPORT  EXTINT14_SWINT30_Handler        [WEAK]
                EXPORT  EXTINT15_SWINT31_Handler        [WEAK]
                EXPORT  DMA1_Error_Handler              [WEAK]
                EXPORT  DMA1_TC0_BTC0_Handler           [WEAK]
                EXPORT  DMA1_TC1_BTC1_Handler           [WEAK]
                EXPORT  DMA1_TC2_BTC2_Handler           [WEAK]
                EXPORT  DMA1_TC3_BTC3_Handler           [WEAK]
                EXPORT  DMA1_TC4_BTC4_Handler           [WEAK]
                EXPORT  DMA1_TC5_BTC5_Handler           [WEAK]
                EXPORT  DMA1_TC6_BTC6_Handler           [WEAK]
                EXPORT  DMA1_TC7_BTC7_Handler           [WEAK]
                EXPORT  EFM_PEError_ReadCol_Handler     [WEAK]
                EXPORT  EFM_OpEnd_Handler               [WEAK]
                EXPORT  QSPI_Handler                    [WEAK]
                EXPORT  DCU1_Handler                    [WEAK]
                EXPORT  DCU2_Handler                    [WEAK]
                EXPORT  DCU3_Handler                    [WEAK]
                EXPORT  DMA2_Error_Handler              [WEAK]
                EXPORT  DMA2_TC0_BTC0_Handler           [WEAK]
                EXPORT  DMA2_TC1_BTC1_Handler           [WEAK]
                EXPORT  DMA2_TC2_BTC2_Handler           [WEAK]
                EXPORT  DMA2_TC3_BTC3_Handler           [WEAK]
                EXPORT  DMA2_TC4_BTC4_Handler           [WEAK]
                EXPORT  DMA2_TC5_BTC5_Handler           [WEAK]
                EXPORT  DMA2_TC6_BTC6_Handler           [WEAK]
                EXPORT  DMA2_TC7_BTC7_Handler           [WEAK]
                EXPORT  MAU_Handler                     [WEAK]
                EXPORT  FMAC1_Handler                   [WEAK]
                EXPORT  FMAC2_Handler                   [WEAK]
                EXPORT  FMAC3_Handler                   [WEAK]
                EXPORT  FMAC4_Handler                   [WEAK]
                EXPORT  TMR0_1_Cmp_Handler              [WEAK]
                EXPORT  TMR0_2_Cmp_Handler              [WEAK]
                EXPORT  TMR2_1_Cmp_Handler              [WEAK]
                EXPORT  TMR2_1_Ovf_Handler              [WEAK]
                EXPORT  TMR2_2_Cmp_Handler              [WEAK]
                EXPORT  TMR2_2_Ovf_Handler              [WEAK]
                EXPORT  TMR2_3_Cmp_Handler              [WEAK]
                EXPORT  TMR2_3_Ovf_Handler              [WEAK]
                EXPORT  TMR2_4_Cmp_Handler              [WEAK]
                EXPORT  TMR2_4_Ovf_Handler              [WEAK]
                EXPORT  RTC_Handler                     [WEAK]
                EXPORT  CLK_XtalStop_Handler            [WEAK]
                EXPORT  PWC_WKTM_Handler                [WEAK]
                EXPORT  SWDT_Handler                    [WEAK]
                EXPORT  TMR6_1_GCmp_Handler             [WEAK]
                EXPORT  TMR6_1_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMR6_1_Dte_Handler               [WEAK]
                EXPORT  TMR6_1_SCmp_Handler             [WEAK]
                EXPORT  TMRA_1_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMRA_1_Cmp_Handler              [WEAK]
                EXPORT  TMR6_2_GCmp_Handler             [WEAK]
                EXPORT  TMR6_2_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMR6_2_Dte_Handler               [WEAK]
                EXPORT  TMR6_2_SCmp_Handler             [WEAK]
                EXPORT  TMRA_2_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMRA_2_Cmp_Handler              [WEAK]
                EXPORT  TMR6_3_GCmp_Handler             [WEAK]
                EXPORT  TMR6_3_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMR6_3_Dte_Handler               [WEAK]
                EXPORT  TMR6_3_SCmp_Handler             [WEAK]
                EXPORT  TMRA_3_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMRA_3_Cmp_Handler              [WEAK]
                EXPORT  TMR6_4_GCmp_Handler             [WEAK]
                EXPORT  TMR6_4_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMR6_4_Dte_Handler               [WEAK]
                EXPORT  TMR6_4_SCmp_Handler             [WEAK]
                EXPORT  TMRA_4_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMRA_4_Cmp_Handler              [WEAK]
                EXPORT  TMR6_5_GCmp_Handler             [WEAK]
                EXPORT  TMR6_5_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMR6_5_Dte_Handler               [WEAK]
                EXPORT  TMR6_5_SCmp_Handler             [WEAK]
                EXPORT  TMR6_6_GCmp_Handler             [WEAK]
                EXPORT  TMR6_6_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMR6_6_Dte_Handler               [WEAK]
                EXPORT  TMR6_6_SCmp_Handler             [WEAK]
                EXPORT  TMR6_7_GCmp_Handler             [WEAK]
                EXPORT  TMR6_7_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMR6_7_Dte_Handler               [WEAK]
                EXPORT  TMR6_7_SCmp_Handler             [WEAK]
                EXPORT  TMR6_8_GCmp_Handler             [WEAK]
                EXPORT  TMR6_8_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMR6_8_Dte_Handler               [WEAK]
                EXPORT  TMR6_8_SCmp_Handler             [WEAK]
                EXPORT  TMR6_9_GCmp_Handler             [WEAK]
                EXPORT  TMR6_9_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMR6_9_Dte_Handler               [WEAK]
                EXPORT  TMR6_9_SCmp_Handler             [WEAK]
                EXPORT  TMR6_10_GCmp_Handler            [WEAK]
                EXPORT  TMR6_10_Ovf_Udf_Handler         [WEAK]
                EXPORT  TMR6_10_Dte_Handler              [WEAK]
                EXPORT  TMR6_10_SCmp_Handler            [WEAK]
                EXPORT  TMR4_1_GCmp_Handler             [WEAK]
                EXPORT  TMR4_1_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMR4_1_Reload_Handler           [WEAK]
                EXPORT  TMR4_1_SCmp_Handler             [WEAK]
                EXPORT  CMP1_Handler                    [WEAK]
                EXPORT  CMP2_Handler                    [WEAK]
                EXPORT  CMP3_Handler                    [WEAK]
                EXPORT  CMP4_Handler                    [WEAK]
                EXPORT  CAN1_Handler                    [WEAK]
                EXPORT  CAN2_Handler                    [WEAK]
                EXPORT  CAN3_Handler                    [WEAK]
                EXPORT  USART1_Handler                  [WEAK]
                EXPORT  USART2_Handler                  [WEAK]
                EXPORT  SPI1_Handler                    [WEAK]
                EXPORT  SPI2_Handler                    [WEAK]
                EXPORT  TMRA_5_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMRA_5_Cmp_Handler              [WEAK]
                EXPORT  TMRA_6_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMRA_6_Cmp_Handler              [WEAK]
                EXPORT  USBFS_Handler                   [WEAK]
                EXPORT  EVENT_PORT1_Handler             [WEAK]
                EXPORT  EVENT_PORT2_Handler             [WEAK]
                EXPORT  EVENT_PORT3_Handler             [WEAK]
                EXPORT  EVENT_PORT4_Handler             [WEAK]
                EXPORT  USART3_Handler                  [WEAK]
                EXPORT  USART4_Handler                  [WEAK]
                EXPORT  SPI3_Handler                    [WEAK]
                EXPORT  SPI4_Handler                    [WEAK]
                EXPORT  EMB_GR0_Handler                 [WEAK]
                EXPORT  EMB_GR1_Handler                 [WEAK]
                EXPORT  EMB_GR2_Handler                 [WEAK]
                EXPORT  EMB_GR3_Handler                 [WEAK]
                EXPORT  EMB_GR4_Handler                 [WEAK]
                EXPORT  EMB_GR5_Handler                 [WEAK]
                EXPORT  EMB_GR6_Handler                 [WEAK]
                EXPORT  HASH_Handler                    [WEAK]
                EXPORT  USART5_Handler                  [WEAK]
                EXPORT  USART6_Handler                  [WEAK]
                EXPORT  MDIO_Handler                    [WEAK]
                EXPORT  PLA_Handler                     [WEAK]
                EXPORT  I2C1_Handler                    [WEAK]
                EXPORT  I2C2_Handler                    [WEAK]
                EXPORT  I2C3_Handler                    [WEAK]
                EXPORT  USART1_WKUP_Handler             [WEAK]
                EXPORT  PWC_LVD1_Handler                [WEAK]
                EXPORT  PWC_LVD2_Handler                [WEAK]
                EXPORT  OTS_Handler                     [WEAK]
                EXPORT  FCM_Handler                     [WEAK]
                EXPORT  WDT_Handler                     [WEAK]
                EXPORT  CTC_Handler                     [WEAK]
                EXPORT  ADC1_Handler                    [WEAK]
                EXPORT  ADC2_Handler                    [WEAK]
                EXPORT  ADC3_Handler                    [WEAK]
                EXPORT  TRNG_Handler                    [WEAK]
                EXPORT  USART1_TxComplete_Handler       [WEAK]
                EXPORT  USART2_TxComplete_Handler       [WEAK]
                EXPORT  USART3_TxComplete_Handler       [WEAK]
                EXPORT  USART4_TxComplete_Handler       [WEAK]
                EXPORT  USART5_TxComplete_Handler       [WEAK]
                EXPORT  USART6_TxComplete_Handler       [WEAK]

