RT-Thread/rt-thread/bsp/hc32/libraries/hc32f472_ddl/cmsis/Device/HDSC/hc32f4xx/Source/ARM/startup_hc32f472.s
IRQ000_Handler
IRQ001_Handler
IRQ002_Handler
IRQ003_Handler
IRQ004_Handler
IRQ005_Handler
IRQ006_Handler
IRQ007_Handler
IRQ008_Handler
IRQ009_Handler
IRQ010_Handler
IRQ011_Handler
IRQ012_Handler
IRQ013_Handler
IRQ014_Handler
IRQ015_Handler
EXTINT00_SWINT16_Handler
EXTINT01_SWINT17_Handler
EXTINT02_SWINT18_Handler
EXTINT03_SWINT19_Handler
EXTINT04_SWINT20_Handler
EXTINT05_SWINT21_Handler
EXTINT06_SWINT22_Handler
EXTINT07_SWINT23_Handler
EXTINT08_SWINT24_Handler
EXTINT09_SWINT25_Handler
EXTINT10_SWINT26_Handler
EXTINT11_SWINT27_Handler
EXTINT12_SWINT28_Handler
EXTINT13_SWINT29_Handler
EXTINT14_SWINT30_Handler
EXTINT15_SWINT31_Handler
DMA1_Error_Handler
DMA1_TC0_BTC0_Handler
DMA1_TC1_BTC1_Handler
DMA1_TC2_BTC2_Handler
DMA1_TC3_BTC3_Handler
DMA1_TC4_BTC4_Handler
DMA1_TC5_BTC5_Handler
DMA1_TC6_BTC6_Handler
DMA1_TC7_BTC7_Handler
EFM_PEError_ReadCol_Handler
EFM_OpEnd_Handler
QSPI_Handler
DCU1_Handler
DCU2_Handler
DCU3_Handler
DMA2_Error_Handler
DMA2_TC0_BTC0_Handler
DMA2_TC1_BTC1_Handler
DMA2_TC2_BTC2_Handler
DMA2_TC3_BTC3_Handler
DMA2_TC4_BTC4_Handler
DMA2_TC5_BTC5_Handler
DMA2_TC6_BTC6_Handler
DMA2_TC7_BTC7_Handler
MAU_Handler
FMAC1_Handler
FMAC2_Handler
FMAC3_Handler
FMAC4_Handler
TMR0_1_Cmp_Handler
TMR0_2_Cmp_Handler
TMR2_1_Cmp_Handler
TMR2_1_Ovf_Handler
TMR2_2_Cmp_Handler
TMR2_2_Ovf_Handler
TMR2_3_Cmp_Handler
TMR2_3_Ovf_Handler
TMR2_4_Cmp_Handler
TMR2_4_Ovf_Handler
RTC_Handler
CLK_XtalStop_Handler
PWC_WKTM_Handler
SWDT_Handler
TMR6_1_GCmp_Handler
TMR6_1_Ovf_Udf_Handler
TMR6_1_Dte_Handler
TMR6_1_SCmp_Handler
TMRA_1_Ovf_Udf_Handler
TMRA_1_Cmp_Handler
TMR6_2_GCmp_Handler
TMR6_2_Ovf_Udf_Handler
TMR6_2_Dte_Handler
TMR6_2_SCmp_Handler
TMRA_2_Ovf_Udf_Handler
TMRA_2_Cmp_Handler
TMR6_3_GCmp_Handler
TMR6_3_Ovf_Udf_Handler
TMR6_3_Dte_Handler
TMR6_3_SCmp_Handler
TMRA_3_Ovf_Udf_Handler
TMRA_3_Cmp_Handler
TMR6_4_GCmp_Handler
TMR6_4_Ovf_Udf_Handler
TMR6_4_Dte_Handler
TMR6_4_SCmp_Handler
TMRA_4_Ovf_Udf_Handler
TMRA_4_Cmp_Handler
TMR6_5_GCmp_Handler
TMR6_5_Ovf_Udf_Handler
TMR6_5_Dte_Handler
TMR6_5_SCmp_Handler
TMR6_6_GCmp_Handler
TMR6_6_Ovf_Udf_Handler
TMR6_6_Dte_Handler
TMR6_6_SCmp_Handler
TMR6_7_GCmp_Handler
TMR6_7_Ovf_Udf_Handler
TMR6_7_Dte_Handler
TMR6_7_SCmp_Handler
TMR6_8_GCmp_Handler
TMR6_8_Ovf_Udf_Handler
TMR6_8_Dte_Handler
TMR6_8_SCmp_Handler
TMR6_9_GCmp_Handler
TMR6_9_Ovf_Udf_Handler
TMR6_9_Dte_Handler
TMR6_9_SCmp_Handler
TMR6_10_GCmp_Handler
TMR6_10_Ovf_Udf_Handler
TMR6_10_Dte_Handler
TMR6_10_SCmp_Handler
TMR4_1_GCmp_Handler
TMR4_1_Ovf_Udf_Handler
TMR4_1_Reload_Handler
TMR4_1_SCmp_Handler
CMP1_Handler
CMP2_Handler
CMP3_Handler
CMP4_Handler
CAN1_Handler
CAN2_Handler
CAN3_Handler
USART1_Handler
USART2_Handler
SPI1_Handler
SPI2_Handler
TMRA_5_Ovf_Udf_Handler
TMRA_5_Cmp_Handler
TMRA_6_Ovf_Udf_Handler
TMRA_6_Cmp_Handler
USBFS_Handler
EVENT_PORT1_Handler
EVENT_PORT2_Handler
EVENT_PORT3_Handler
EVENT_PORT4_Handler
USART3_Handler
USART4_Handler
SPI3_Handler
SPI4_Handler
EMB_GR0_Handler
EMB_GR1_Handler
EMB_GR2_Handler
EMB_GR3_Handler
EMB_GR4_Handler
EMB_GR5_Handler
EMB_GR6_Handler
HASH_Handler
USART5_Handler
USART6_Handler
MDIO_Handler
PLA_Handler
I2C1_Handler
I2C2_Handler
I2C3_Handler
USART1_WKUP_Handler
PWC_LVD1_Handler
PWC_LVD2_Handler
OTS_Handler
FCM_Handler
WDT_Handler
CTC_Handler
ADC1_Handler
ADC2_Handler
ADC3_Handler
TRNG_Handler
USART1_TxComplete_Handler
USART2_TxComplete_Handler
USART3_TxComplete_Handler
USART4_TxComplete_Handler
USART5_TxComplete_Handler
USART6_TxComplete_Handler

                B       .
                ENDP

                ALIGN


; User Initial Stack & Heap

                IF      :DEF:__MICROLIB

                EXPORT  __initial_sp
                EXPORT  __heap_base
                EXPORT  __heap_limit

                ELSE

                IMPORT  __use_two_region_memory
                EXPORT  __user_initial_stackheap

__user_initial_stackheap
                LDR     R0, =  Heap_Mem
                LDR     R1, =(Stack_Mem + Stack_Size)
                LDR     R2, = (Heap_Mem +  Heap_Size)
                LDR     R3, = Stack_Mem
                BX      LR

                ALIGN

                ENDIF


                END
